Repository: onursonmez3437/stajGorevlerim-main
Catalog: WebApplication1/App_GlobalResources/Resources.*.resx
Languages: tr

source: HOME
tr: ANA SAYFA

source: ABOUT ME
tr: HAKKIMDA

source: WHAT IT IS
tr: NEDİR

source: CONTACT US
tr: İLETİSİM

# HomePageWelcomeMessage
source: WELCOME TO MY INTERNSHIP BLOG
tr: STAJDA ÖĞRENDİKLERİM BLOĞUNA HOŞ GELDİNİZ

# StajdaÖğrendiklerimİlkParagraf
source: During this internship, I had the opportunity to learn and experience many new technologies in the software world. During my work, I mainly used <strongg>ASP.NET Core</strongg> technology and learned how to develop web applications efficiently with this framework.
tr: Bu staj sürecinde, yazılım dünyasında birçok yeni teknolojiyi öğrenme ve deneyimleme fırsatım oldu. Çalışmalarım sırasında ağırlıklı olarak <strongg>ASP.NET Core</strongg> teknolojisi kullandım ve bu framework ile nasıl verimli bir şekilde web uygulamaları geliştirebileceğimi öğrendim.

# StajdaÖğrendiklerimİkinciParagraf
source: I also learned how to use <strongg>Git</strongg> in version control systems to manage code more effectively in a team environment. In the process, I mastered Git commands such as versioning, creating branches, merging, and resolving issues.
tr: Ayrıca, versiyon kontrol sistemlerinde <strongg>Git</strongg> kullanarak ekip çalışmasında kod yönetimini nasıl daha etkili yapabileceğimi öğrendim. Bu süreçte versiyonlama, dallar oluşturma, birleştirme ve sorunları çözme gibi Git komutlarına hakim oldum.

# StajdaÖğrendiklerimÜcüncüParagraf
source: I also had the chance to improve myself in web technologies such as <strongg>HTML</strongg>, <strongg>CSS</strongg>, <strongg>JavaScript</strongg> and <strongg>jQuery</strongg>.
tr: <strongg>HTML</strongg>, <strongg>CSS</strongg>, <strongg>JavaScript</strongg> ve <strongg>jQuery</strongg> gibi web teknolojilerinde de kendimi geliştirme şansı buldum.

# StajdaÖğrendiklerimDördüncüParagraf
source: Specifically: I worked on <strongg>HTML and CSS</strongg> to create user-friendly and modern designs. I improved my skills in JavaScript to develop dynamic and interactive web pages. I used the <strongg>jQuery</strongg> library to create faster and more practical solutions.
tr: Özellikle: Kullanıcı dostu ve modern tasarımlar oluşturmak için <strongg>HTML ve CSS</strongg> üzerinde çalıştım. Dinamik ve etkileşimli web sayfaları geliştirmek için JavaScript'teki yeteneklerimi geliştirdim. <strongg>jQuery</strongg> kütüphanesini kullanarak daha hızlı ve pratik çözümler ürettim.

# StajdaÖğrendiklerimBesinciParagraf
source: This internship not only provided me with technical skills, but also strengthened my problem-solving ability and my role in teamwork. I look forward to utilizing these gains in my future roles ✨
tr: Bu staj, bana sadece teknik beceriler kazandırmakla kalmadı, aynı zamanda problem çözme yeteneğimi ve ekip çalışmasındaki rolümü güçlendirdi. Gelecekteki görevlerimde bu kazanımlarımı kullanmayı heyecanla bekliyorum.✨

# StajdaÖğrendiklerimAltıncıParagraf
source: <strongg>Thank you PHOTIER for giving me this opportunity and for all your help 🙏❤️ </strongg>
tr: <strongg>BANA BU FIRSATI SUNDUĞUNUZ İÇİN VE TÜM YARDIMLARINIZ İÇİN TEŞEKKÜRLER PHOTIER 🙏❤️ </strongg>
